; domain
(define (domain alfred-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :conditional-effects :existential-preconditions :constraints :action-costs)
 (:types
    receptacletype objecttype checkable - object
    agent location receptacle obj - checkable
 )
 (:constants
   sinkbasintype fridgetype microwavetype - receptacletype
   butterknifetype knifetype - objecttype
 )
 (:predicates (atlocation ?a - agent ?l - location) (receptacleatlocation ?r - receptacle ?l - location) (objectatlocation ?o - obj ?l - location) (openable ?r - receptacle) (opened ?r - receptacle) (inreceptacle ?o - obj ?r - receptacle) (isreceptacleobject ?o - obj) (inreceptacleobject ?innerobject - obj ?outobject - obj) (isreceptacleobjectfull ?o - obj) (wasinreceptacle ?o - obj ?r - receptacle) (checked ?c - checkable) (examined ?l - location) (receptacletype_0 ?r - receptacle ?rt - receptacletype) (cancontain ?rt - receptacletype ?ot - objecttype) (objecttype_0 ?o - obj ?t - objecttype) (holds ?a - agent ?o - obj) (holdsany ?a - agent) (holdsanyreceptacleobject ?a - agent) (full ?r - receptacle) (isclean ?o - obj) (cleanable ?o - obj) (ishot ?o - obj) (heatable ?o - obj) (iscool ?o - obj) (coolable ?o - obj) (pickupable ?o - obj) (moveable ?o - obj) (toggleable ?o - obj) (ison ?o - obj) (istoggled ?o - obj) (sliceable ?o - obj) (issliced ?o - obj))
 (:functions (total-cost))
 (:action look
  :parameters ( ?a - agent ?l - location)
  :precondition (and (atlocation ?a ?l))
  :effect (and (checked ?l) (increase (total-cost) 1)))
 (:action inventory
  :parameters ( ?a - agent)
  :effect (and (checked ?a) (increase (total-cost) 1)))
 (:action examinereceptacle
  :parameters ( ?a - agent ?r - receptacle)
  :precondition (and (exists (?l_0 - location)
 (and (atlocation ?a ?l_0) (receptacleatlocation ?r ?l_0))))
  :effect (and (checked ?r) (increase (total-cost) 1)))
 (:action examineobject
  :parameters ( ?a - agent ?o - obj)
  :precondition (and (or (exists (?l_0 - location)
 (exists (?r_0 - receptacle)
 (and (atlocation ?a ?l_0) (receptacleatlocation ?r_0 ?l_0) (inreceptacle ?o ?r_0) (or (not (openable ?r_0)) (opened ?r_0))))) (holds ?a ?o)))
  :effect (and (checked ?o) (increase (total-cost) 1)))
 (:action gotolocation
  :parameters ( ?a - agent ?lstart - location ?lend - location)
  :precondition (and (atlocation ?a ?lstart))
  :effect (and (not (atlocation ?a ?lstart)) (atlocation ?a ?lend) (increase (total-cost) 1)))
 (:action openobject
  :parameters ( ?a - agent ?l - location ?r - receptacle)
  :precondition (and (openable ?r) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (not (opened ?r)))
  :effect (and (opened ?r) (checked ?r) (increase (total-cost) 1)))
 (:action closeobject
  :parameters ( ?a - agent ?l - location ?r - receptacle)
  :precondition (and (openable ?r) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (opened ?r))
  :effect (and (not (opened ?r)) (increase (total-cost) 1)))
 (:action pickupobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle)
  :precondition (and (pickupable ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (inreceptacle ?o ?r) (not (holdsany ?a)) (or (not (openable ?r)) (opened ?r)))
  :effect (and (not (inreceptacle ?o ?r)) (holds ?a ?o) (holdsany ?a) (not (objectatlocation ?o ?l)) (increase (total-cost) 1)))
 (:action putobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle ?ot - objecttype ?rt - receptacletype)
  :precondition (and (holds ?a ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (or (not (openable ?r)) (opened ?r)) (objecttype_0 ?o ?ot) (receptacletype_0 ?r ?rt) (cancontain ?rt ?ot))
  :effect (and (inreceptacle ?o ?r) (objectatlocation ?o ?l) (not (holds ?a ?o)) (not (holdsany ?a)) (increase (total-cost) 1)))
 (:action cleanobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (cleanable ?o) (receptacletype_0 ?r sinkbasintype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (isclean ?o) (increase (total-cost) 1)))
 (:action heatobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (heatable ?o) (receptacletype_0 ?r microwavetype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (ishot ?o) (not (iscool ?o)) (increase (total-cost) 1)))
 (:action coolobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (coolable ?o) (receptacletype_0 ?r fridgetype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (iscool ?o) (not (ishot ?o)) (increase (total-cost) 1)))
 (:action toggleobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle)
  :precondition (and (toggleable ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (inreceptacle ?o ?r))
  :effect (and (when (ison ?o) (not (ison ?o))) (when (not (ison ?o)) (ison ?o)) (istoggled ?o) (increase (total-cost) 1)))
 (:action sliceobject
  :parameters ( ?a - agent ?l - location ?co - obj ?ko - obj)
  :precondition (and (sliceable ?co) (or (objecttype_0 ?ko knifetype) (objecttype_0 ?ko butterknifetype)) (atlocation ?a ?l) (objectatlocation ?co ?l) (holds ?a ?ko))
  :effect (and (issliced ?co) (increase (total-cost) 1)))
 (:action help
  :parameters ( ?a - agent)
  :effect (and (checked ?a) (increase (total-cost) 1)))
)

; problem
(define (problem alfred-problem)
 (:domain alfred-domain)
 (:objects
   desktype laundryhampertype handtowelholdertype armchairtype toiletpaperhangertype - receptacletype
   potatotype clothtype boxtype platetype mugtype - objecttype
   agent1 - agent
   location1 location2 location3 location4 location5 - location
   desk_1 laundryhamper_2 handtowelholder_3 armchair_4 toiletpaperhanger_5 microwave_6 fridge_7 - receptacle
   potato_1 cloth_2 box_3 plate_4 mug_5 - obj
 )
 (:init (receptacletype_0 desk_1 desktype) (receptacletype_0 laundryhamper_2 laundryhampertype) (receptacletype_0 handtowelholder_3 handtowelholdertype) (receptacletype_0 armchair_4 armchairtype) (receptacletype_0 toiletpaperhanger_5 toiletpaperhangertype) (receptacletype_0 microwave_6 microwavetype) (receptacletype_0 fridge_7 fridgetype) (objecttype_0 potato_1 potatotype) (objecttype_0 cloth_2 clothtype) (objecttype_0 box_3 boxtype) (objecttype_0 plate_4 platetype) (objecttype_0 mug_5 mugtype) (cancontain desktype clothtype) (cancontain desktype boxtype) (cancontain desktype platetype) (cancontain desktype mugtype) (cancontain laundryhampertype clothtype) (cancontain armchairtype clothtype) (cancontain armchairtype boxtype) (cancontain microwavetype potatotype) (cancontain microwavetype platetype) (cancontain microwavetype mugtype) (cancontain fridgetype potatotype) (cancontain fridgetype platetype) (cancontain fridgetype mugtype) (pickupable potato_1) (cleanable potato_1) (heatable potato_1) (coolable potato_1) (sliceable potato_1) (pickupable cloth_2) (cleanable cloth_2) (pickupable box_3) (isreceptacleobject box_3) (pickupable plate_4) (isreceptacleobject plate_4) (cleanable plate_4) (heatable plate_4) (coolable plate_4) (pickupable mug_5) (isreceptacleobject mug_5) (cleanable mug_5) (heatable mug_5) (coolable mug_5) (receptacleatlocation desk_1 location4) (receptacleatlocation laundryhamper_2 location4) (receptacleatlocation handtowelholder_3 location5) (receptacleatlocation armchair_4 location5) (receptacleatlocation toiletpaperhanger_5 location3) (receptacleatlocation microwave_6 location3) (receptacleatlocation fridge_7 location2) (inreceptacle potato_1 microwave_6) (inreceptacle cloth_2 armchair_4) (inreceptacle box_3 armchair_4) (inreceptacle plate_4 microwave_6) (inreceptacle mug_5 microwave_6) (objectatlocation potato_1 location3) (objectatlocation cloth_2 location5) (objectatlocation box_3 location5) (objectatlocation plate_4 location3) (objectatlocation mug_5 location3) (atlocation agent1 location4) (= (total-cost) 0))
 (:goal (and (exists (?r_0 - receptacle)
 (exists (?o1 - obj)
 (and (inreceptacle ?o1 ?r_0) (objecttype_0 ?o1 mugtype) (receptacletype_0 ?r_0 fridgetype) (exists (?o2 - obj)
 (and (not (= ?o1 ?o2)) (objecttype_0 ?o2 platetype) (receptacletype_0 ?r_0 fridgetype) (inreceptacle ?o2 ?r_0))))))))
 (:constraints (sometime (holds agent1 mug_5)) (sometime-before (holds agent1 mug_5) (checked mug_5)) (sometime (checked microwave_6)) (sometime (atlocation agent1 location2)) (sometime-before (atlocation agent1 location2) (or (checked location3) (objectatlocation plate_4 location4))) (sometime (checked box_3)) (sometime (atlocation agent1 location5)) (sometime (or (holds agent1 cloth_2) (checked laundryhamper_2))) (sometime (holds agent1 plate_4)) (sometime-after (holds agent1 plate_4) (objectatlocation mug_5 location4)))
 (:metric minimize (total-cost))
)

; plan
1. (gotolocation agent1 location4 location5)
   deleted: (atlocation agent1 location4)
   added: (atlocation agent1 location5)
   goals met: 0 of 1
2. (examineobject agent1 box_3)
   added: (checked box_3)
   goals met: 0 of 1
3. (gotolocation agent1 location5 location3)
   deleted: (atlocation agent1 location5)
   added: (atlocation agent1 location3)
   goals met: 0 of 1
4. (pickupobject agent1 location3 plate_4 microwave_6)
   deleted: (inreceptacle plate_4 microwave_6) (objectatlocation plate_4 location3)
   added: (holds agent1 plate_4) (holdsany agent1)
   goals met: 0 of 1
5. (look agent1 location3)
   added: (checked location3)
   goals met: 0 of 1
6. (gotolocation agent1 location3 location2)
   deleted: (atlocation agent1 location3)
   added: (atlocation agent1 location2)
   goals met: 0 of 1
7. (putobject agent1 location2 plate_4 fridge_7 platetype fridgetype)
   deleted: (holds agent1 plate_4) (holdsany agent1)
   added: (inreceptacle plate_4 fridge_7) (objectatlocation plate_4 location2)
   goals met: 0 of 1
8. (gotolocation agent1 location2 location3)
   deleted: (atlocation agent1 location2)
   added: (atlocation agent1 location3)
   goals met: 0 of 1
9. (examineobject agent1 mug_5)
   added: (checked mug_5)
   goals met: 0 of 1
10. (pickupobject agent1 location3 mug_5 microwave_6)
   deleted: (inreceptacle mug_5 microwave_6) (objectatlocation mug_5 location3)
   added: (holds agent1 mug_5) (holdsany agent1)
   goals met: 0 of 1
11. (examinereceptacle agent1 microwave_6)
   added: (checked microwave_6)
   goals met: 0 of 1
12. (gotolocation agent1 location3 location4)
   deleted: (atlocation agent1 location3)
   added: (atlocation agent1 location4)
   goals met: 0 of 1
13. (putobject agent1 location4 mug_5 desk_1 mugtype desktype)
   deleted: (holds agent1 mug_5) (holdsany agent1)
   added: (inreceptacle mug_5 desk_1) (objectatlocation mug_5 location4)
   goals met: 0 of 1
14. (examinereceptacle agent1 laundryhamper_2)
   added: (checked laundryhamper_2)
   goals met: 0 of 1
15. (pickupobject agent1 location4 mug_5 desk_1)
   deleted: (inreceptacle mug_5 desk_1) (objectatlocation mug_5 location4)
   added: (holds agent1 mug_5) (holdsany agent1)
   goals met: 0 of 1
16. (gotolocation agent1 location4 location2)
   deleted: (atlocation agent1 location4)
   added: (atlocation agent1 location2)
   goals met: 0 of 1
17. (putobject agent1 location2 mug_5 fridge_7 mugtype fridgetype)
   deleted: (holds agent1 mug_5) (holdsany agent1)
   added: (inreceptacle mug_5 fridge_7) (objectatlocation mug_5 location2)
   goals met: 1 of 1
